#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["gowrizrh"]: Refreshing state... [id=Mage-OS:gowrizrh]
github_membership.users["DavidLambauer"]: Refreshing state... [id=Mage-OS:DavidLambauer]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["async-events"]: Refreshing state... [id=7998296]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=6847101:damienwebdev]
github_team_membership.members["gowrizrh_async-events"]: Refreshing state... [id=7998296:gowrizrh]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=6847100:DavidLambauer]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbWgc4CQwEW]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDOH_yQpc4B1Gmt]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=BPR_kwDOJIrSxM4CGjIG]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDOH_yQXM4B1Gm0]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-quality-patches"]: Refreshing state... [id=BPR_kwDOJIrSsM4CGjIE]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbVr84CQwEY]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_repository_file.codeowners["mageos-composer"]: Refreshing state... [id=mageos-composer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events"]: Refreshing state... [id=mageos-async-events/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["meta"]: Refreshing state... [id=meta/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["github-actions"]: Refreshing state... [id=github-actions/CODEOWNERS]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-composer"]: Refreshing state... [id=6847098:mageos-composer]
github_team_repository.tech-lead["github-actions"]: Refreshing state... [id=6847098:github-actions]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=6847098:mageos-magento2-functional-testing-framework]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.tech-lead["mageos-magento-coding-standard"]: Refreshing state... [id=6847098:mageos-magento-coding-standard]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["meta"]: Refreshing state... [id=6847098:meta]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["dev-env-gitpod"]: Refreshing state... [id=6847098:dev-env-gitpod]
github_branch_default.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["mageos-async-events"]: Refreshing state... [id=6847098:mageos-async-events]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-async-events_distribution"]: Refreshing state... [id=6847101:mageos-async-events]
github_team_repository.teams["meta_infrastructure"]: Refreshing state... [id=6847100:meta]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["meta_content"]: Refreshing state... [id=6847102:meta]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"]: Refreshing state... [id=6847101:mageos-magento2-functional-testing-framework]
github_team_repository.teams["meta_distribution"]: Refreshing state... [id=6847101:meta]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-magento-coding-standard_distribution"]: Refreshing state... [id=6847101:mageos-magento-coding-standard]
github_team_repository.teams["dev-env-gitpod_infrastructure"]: Refreshing state... [id=6847100:dev-env-gitpod]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_team_repository.teams["github-actions_distribution"]: Refreshing state... [id=6847101:github-actions]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["terraform_infrastructure"]: Refreshing state... [id=6847100:terraform]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-composer_distribution"]: Refreshing state... [id=6847101:mageos-composer]
github_team_repository.teams["meta_tech-lead"]: Refreshing state... [id=6847098:meta]
github_team_repository.teams["mageos-async-events_async-events"]: Refreshing state... [id=7998296:mageos-async-events]
github_branch_protection.repositories["mageos-composer"]: Refreshing state... [id=BPR_kwDOJpba4M4CQwER]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbZ9c4CQwEV]
github_branch_protection.repositories["meta"]: Refreshing state... [id=BPR_kwDOJIrS4M4CGjIK]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["mageos-async-events"]: Refreshing state... [id=BPR_kwDOJIrSz84CGjIQ]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["dev-env-gitpod"]: Refreshing state... [id=BPR_kwDOIfCi6c4B3JNi]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbY-84CQwEP]
github_branch_protection.repositories["github-actions"]: Refreshing state... [id=BPR_kwDOJVdHWc4CK7Rj]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.users["DavidLambauer"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"8ba1c861d1d2a66d384e97058eeb0bf924a148b043656b5c183739b7f31b3b0a\"" -> "W/\"23809c9ab324300f08445511bf60cb85be5f1a9ee847e5fabd3b9724b5c4c301\""
        id       = "Mage-OS:DavidLambauer"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"a0ad5ddfde341fe714126a8c4231e56701e6a5425a13b4d5dd2c1efdde7b6ea1\"" -> "W/\"037025e0341b62e5c147df82bee78554f7f38ce9738663e1fa15ecfb36c375b5\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"03833890147969af57fe96c0093f54d7203570cbfaee59fa677109c620970630\"" -> "W/\"04cbaecc8ac247efbdbeaaa5160f319928be83252abbfc24655ace3025d1469f\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["gowrizrh"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"834e5541ba1e370522c10ed97e4c6d7652a04dde4acd53902f38b035660cdd91\"" -> "W/\"cf21f832365632e69dc3de63f10ff312b8582d53aa067d033ee041deb92b29af\""
        id       = "Mage-OS:gowrizrh"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"725e0a08cc775af998fc6a65815319cb2162b1c5614bc82199f5245834c66ac0\"" -> "W/\"c15bb8d4e47e9305526053f914ad9e67bc6a2efe1d827d56872c8e759dea6c25\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"80e54461c54d6e1497837ba167494eb6d8bc2d2d240d42658c39c8fc38020df4\"" -> "W/\"238db07990b139ae190d57933528f3606dd507d39c4e0cde108e84bcf3be8870\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"f0a4f5c055a5de04bea1549a8e177278b33b2ed7139c8af26564f72b5284147e\"" -> "W/\"93c8c632d35f0abf334edcd555dea0f0062d26be0c8f919e9dbdd914b9334f4d\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"ce90e92f0dc757d313546c0640b736c9a025babbac0cbe0277a565a3f93e8802\"" -> "W/\"30c75547ab29750d81ac046f7f2000d3716716638fc7c7f1a37c813c83f14327\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-adobe-ims"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"e03fb00d0bb96609dd3d30d3e3536d01444a2a6f9650091f92c1a89eba42bd00\"" -> "W/\"02ee5b250211ebee50db2efd50361bac0bc22db8836541111a2f59795493e059\""
        id                          = "mirror-adobe-ims"
        name                        = "mirror-adobe-ims"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-adobe-stock-integration"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"19e58e3cd3e51c6e2916563a2eb173eb43bc08afc1f9ce201313a66d7b840ff0\"" -> "W/\"ae92a04ba08f9ccb546b49bfafa80a6295310fbd5d8065ab9d748b6b403b6b81\""
        id                          = "mirror-adobe-stock-integration"
        name                        = "mirror-adobe-stock-integration"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"24040914a311885e2a0e1be939a224d727073ba3547fb5a6406d86d950cc96f1\"" -> "W/\"e404410c78e0b57ea2dd43221b3509c9a0c271a8816772d755a1a9cab783d350\""
        id                          = "mirror-commerce-admin.en"
        name                        = "mirror-commerce-admin.en"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"879bc7ace866123c41fad9d0ff6ac34618105afee69f9e649ab3103808de8677\"" -> "W/\"84e608c8ac14e9d73540855359dbd8b9a2e33919c76794c303e2204f4efc2939\""
        id                          = "mirror-commerce-data-export"
        name                        = "mirror-commerce-data-export"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"34dd7aa1eec24152f58c5d7edf319350cea1512c43e8ab585bc8481fac923c5b\"" -> "W/\"30c2f18e08d559761f667fddea024eaaa817ab76ab999455935d377efe5ec3d4\""
        id                          = "mirror-commerce-operations.en"
        name                        = "mirror-commerce-operations.en"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"00b3dcdc2a9a2dced4fd154b9a0c857b7a6617b6658664503befe77e494ede0f\"" -> "W/\"d575aca752d51dbf4d5d113ae82891381d41b54d30e8c2f7bb1ed844145be6fc\""
        id                          = "mirror-composer"
        name                        = "mirror-composer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"e921358675ab999e9decc331fe8012bf1766b4dd38fcbcb066de198ff5994c67\"" -> "W/\"2f12288451256856130074ee36a2715f64a8e306488c60f955946d852b189a64\""
        id                          = "mirror-composer-dependency-version-audit-plugin"
        name                        = "mirror-composer-dependency-version-audit-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"2959df34cf6170f27283dce81704ad6a799efbc103bd5febc817e0ee98a622d9\"" -> "W/\"f40870bb200552e8e6e6abab01721f7dbeddfd22e65b028353ce8e2f2c242550\""
        id                          = "mirror-composer-root-update-plugin"
        name                        = "mirror-composer-root-update-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-devdocs"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c7572dfcb8f3084a96a9c3f2d6aad87f7584ec3299a32f03cce5b0f22af8854\"" -> "W/\"29c62b1aed104103651b4e8fc11608604704bf39051c1656231677c6af851ad2\""
        id                          = "mirror-devdocs"
        name                        = "mirror-devdocs"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"8de7775c68dbe7cfd15e8308181c6ddd6bd627f50f6d4ca0e0bbedd16554d9c1\"" -> "W/\"33e327d7c5a7cf844877cc248c85db09972295b78cc2d379278dcc0b96fdf40b\""
        id                          = "mirror-inventory"
        name                        = "mirror-inventory"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"9d5da51b0061beace0106fae305abb6c59a41d28527c90963ad640b0c55421f3\"" -> "W/\"2d016cd3f60c7d5b9b28bf1f47756dbede0ee16e216b6046a63ef7841d9db56c\""
        id                          = "mirror-inventory-composer-installer"
        name                        = "mirror-inventory-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-cloud-patches"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"35c77c2fcfb74122a7d866488bbc67c376186990e6d1f5217e5ce6e9f580d161\"" -> "W/\"e373a2ef953daf2a4fbf53a021b5955008f7b308fc415890c861015003e66cd9\""
        id                          = "mirror-magento-cloud-patches"
        name                        = "mirror-magento-cloud-patches"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-coding-standard"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"f007c318e5cbf9a0c0250896086dca227d97232972f25124131f57242eedfb11\"" -> "W/\"56924b1f43fceea270aad6a7898d22e5c1f7c380be13017c4f792969e7f62733\""
        id                          = "mirror-magento-coding-standard"
        name                        = "mirror-magento-coding-standard"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"1baf1ac94d9cad65fd0315ba4805fbf00d1c97cf20b703b5957d9a464125e2e6\"" -> "W/\"83d30cc97a5bfbf2c87bf3cb26059e69690ac107e41cd3d599e8d2727aa72d5e\""
        id                          = "mirror-magento-composer-installer"
        name                        = "mirror-magento-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"72a23be17587255afbf3373410c187bb8df25fa7822fdbe6e1b271bd968647c0\"" -> "W/\"054161522d73425ff762c28a3e8339e28e7146411f2c58560ed7e01f906678e4\""
        id                          = "mirror-magento2"
        name                        = "mirror-magento2"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-functional-testing-framework"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c841e05970021e8b9023b7a0c95bbb2cdea711708615101cc7eb904aee76572\"" -> "W/\"9c3f8fc03f517886334838514403cd5122b4854343ca9717b175d8046fd52c28\""
        id                          = "mirror-magento2-functional-testing-framework"
        name                        = "mirror-magento2-functional-testing-framework"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-page-builder"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6231de6cbd732083c4fb738568773f4c0aee7b296cbdedbe3a9ab83be92791ad\"" -> "W/\"6e555f064b4018ea51f83067f5bb27ea75a6d703e44378bc1ce019b8b791d93d\""
        id                          = "mirror-magento2-page-builder"
        name                        = "mirror-magento2-page-builder"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-sample-data"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"a4939628ad046196a9811e214d761b6c186f4f1045391eb3e1971986e9505d48\"" -> "W/\"0e11cb4910e96d46796424a82e006e83360f84be14ab7d4f415e11e2262f4880\""
        id                          = "mirror-magento2-sample-data"
        name                        = "mirror-magento2-sample-data"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-module-configurable-sample-data-venia"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"940fdb086b56ca82a1d08cd881d7a33d16cc7cd238402c48a1d1d9fe1254a230\"" -> "W/\"c2df458b11cc497814f88266709b20ac1227afc67cc13083d02d868ea956b7fa\""
        id                          = "mirror-module-configurable-sample-data-venia"
        name                        = "mirror-module-configurable-sample-data-venia"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-page-builder-types"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"7429801d0919085ce287fb33b99c72eae1d9f0e893a43d297a6329ca1ca9bd31\"" -> "W/\"8e2023051e7e5de0edaa01c3cc4815552bebaa1a0d797f9b81b7c66c08746733\""
        id                          = "mirror-page-builder-types"
        name                        = "mirror-page-builder-types"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-quality-patches"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"5b0745458c9bfb2320c1a3016645172efbac0b40f3d0bcbe3bae0be082ad0b98\"" -> "W/\"65a382dae19e3f5b64536218b245f85efffdf0deadb1462b89c2f07403b92617\""
        id                          = "mirror-quality-patches"
        name                        = "mirror-quality-patches"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-security-package"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c652a8e8f0ec0f23ce6928b6505202ff4c6d579f935f6d08c0576fe842b6cf0\"" -> "W/\"e531d86256789e3b9d32dfebbfbd6b40e653b07a2ddff215a10e702e82df8358\""
        id                          = "mirror-security-package"
        name                        = "mirror-security-package"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-zf1"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"fcef15e321e47c600aa45f5c54f13ba05ecd19552c2b83573f85149c65b0bca6\"" -> "W/\"d8ceb280cb826c1dd91e2b4f12750d44b5cccb27c956e2624307e17ff71c5da0\""
        id                          = "mirror-zf1"
        name                        = "mirror-zf1"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["dev-env-gitpod"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"88df2f7dff85d975c00cc204e804bb96ab5463f5d11f74d049e978792512b1e0\"" -> "W/\"acb9d3056ac57cfbb0a748c4faed6593a4ca6c870c3bf263161ec7b2aee2a00d\""
        id                          = "dev-env-gitpod"
        name                        = "dev-env-gitpod"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"ad94913177fe534e47a0a5a6f4110dc826c9200cf2761c08aaf2002a654494d9\"" -> "W/\"77a6b5b4b990593ec20e735dbccf9095ae263fd049beafc187833e2fbeb4de94\""
        id                          = "generate-mirror-repo-js"
        name                        = "generate-mirror-repo-js"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["github-actions"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"856fbc9641e02c3474d9d1802ea8ab6a5c090664db9f8b95363da5552954a608\"" -> "W/\"0a05c98c369dd12322cf3b4c8a1ebf4cc82a2d6532e81376a77aaf27716745b0\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["infrastructure"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f133e6877b2d14ba05f5a108f6c08375658641be5bfdec39fd345c174edbeb21\"" -> "W/\"e159315e03d39210dbbbb9470e105ff382f16df6fd5b8460293fa2b96de9a6d4\""
        id                          = "infrastructure"
        name                        = "infrastructure"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"c703dd60ac8d57a6017826ddde35d56f377f44a5e300086868458a15ca76ed6b\"" -> "W/\"513094e302f1193a8735e430eddc1e6638293cde615d51e31405fb764347a6bf\""
        id                          = "mage-os-website"
        name                        = "mage-os-website"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-adobe-stock-integration"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"912d6c4608b910e3f014e5818e355ba447f9d534f4ec42fedab9fd8197dbcc45\"" -> "W/\"4319294f911d42034c1b9d2fb8619387c8b0306b8da12c13cce946ba258565c8\""
        id                          = "mageos-adobe-stock-integration"
        name                        = "mageos-adobe-stock-integration"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"efa15dd3c01bc7992d7d5114b8f8325c63d992d714a7e9c7e71c3560eb7fb761\"" -> "W/\"8cb688bf8f19ceb9f51afa4d036f4c194703079e2d7da0e4461b9b2d45d1746e\""
        id                          = "mageos-async-events"
        name                        = "mageos-async-events"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-commerce-data-export"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"80df79ffee0520e0b83ebabb36c94a3785a6413887facfa8a998b042dbdab94e\"" -> "W/\"b3e132ffdde312305a9735f4a5ae0238726f43962b02e90646794e61170fbf94\""
        id                          = "mageos-commerce-data-export"
        name                        = "mageos-commerce-data-export"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"b7aa92fb1e42a016c2827773785bf584ca5d8ccc3a5b9efa663d590941ee2d23\"" -> "W/\"a1032a8d3bcec98f9676904461aa88be9c96446349f8f75418c6684fab35e182\""
        id                          = "mageos-composer"
        name                        = "mageos-composer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"de77a4609d99589cfb41e1133331cc0a5c0c3fcc16997d2c541621b6dc3aa926\"" -> "W/\"717f1c3793aea95be1458969a95f425e765ea6757c239ffb25fbdbd05f609edd\""
        id                          = "mageos-composer-dependency-version-audit-plugin"
        name                        = "mageos-composer-dependency-version-audit-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"3bd21290c6d2c6f6008d7ac1207ee84e7e2e8374094d5cd2649665f1a36d2629\"" -> "W/\"0339ba3bd2b8d1c01055bbff02a208537dd8c1bcfb3ee6cc64a5baea611c4aca\""
        id                          = "mageos-composer-root-update-plugin"
        name                        = "mageos-composer-root-update-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"e865a1643213ef2c57953c695fc01315622b88cbc8f15922ee0482087a0fe453\"" -> "W/\"220043a6b4ea7d29c84bcc3a48a4d0b796f47a21d67509ee717d7dacf605b84a\""
        id                          = "mageos-inventory"
        name                        = "mageos-inventory"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"a8609c7833f8bb75f2485dc4ea20fd2c4012d500ad1acca94d2cd20854195c76\"" -> "W/\"656e5efe1b36ca1e4314a7514f30263ff802cfb147f5be7ad8d700eb3e63e199\""
        id                          = "mageos-inventory-composer-installer"
        name                        = "mageos-inventory-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-coding-standard"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f308a2c73f37b13d6bc733e819f139e476204c901194487ef3146c25d015b47b\"" -> "W/\"3d6ee496ef70d41c4d60d92e288678c12d7d4b120d299b111e0f5c4f804da20c\""
        id                          = "mageos-magento-coding-standard"
        name                        = "mageos-magento-coding-standard"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f7439251a91f7c0a5c086242caa26a0d23e8cb7dc248411de042c5681092b4a9\"" -> "W/\"06a47674ce6186e07b49ebd6704cdf1e17a5e46cbd259e5023d40986a3cc1507\""
        id                          = "mageos-magento-composer-installer"
        name                        = "mageos-magento-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"4d9913a5818f9b51fa13e7d7505b6837ae8ef15629873b1d5c4f0d60347f6550\"" -> "W/\"facc0975a78da7b83c096be915b3b5e00eff69a6c351e8dd0f2a2a034b4d69a0\""
        id                          = "mageos-magento2"
        name                        = "mageos-magento2"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-functional-testing-framework"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"cf6ff71179562f52c33ac449656ec1b92d6a1331d462991314585d12acae3e93\"" -> "W/\"31bb9f4d1d407d43543a5b98d9edb8fc982a684a77769ecbf3ed7a57bb417f98\""
        id                          = "mageos-magento2-functional-testing-framework"
        name                        = "mageos-magento2-functional-testing-framework"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-page-builder"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"adee21514a6b64420f07f4de988990db0ca1410afb3bc400bd2e7cd135b1d09b\"" -> "W/\"e1f328bed3b42116e316ea06e096e27e81a9d3effea554b2ba38c52f56a6d4db\""
        id                          = "mageos-magento2-page-builder"
        name                        = "mageos-magento2-page-builder"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-sample-data"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"9bcf176c5d24c3ffc8ba43c35b801e5e860301eb28f5f1ef94c8846e0f6927e8\"" -> "W/\"2ef3ac3375215b972c8df5accf05cb56d8a78b20e78cbbac19b8e594cdd7fbf5\""
        id                          = "mageos-magento2-sample-data"
        name                        = "mageos-magento2-sample-data"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-security-package"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"42eb47a3152b1a07688c68f343eff78adcefef5e6abfc1475ec1c5c011679f52\"" -> "W/\"bf782bc660c1add72ff66a96246ceee271607f65f85c7d6a871c67586919599b\""
        id                          = "mageos-security-package"
        name                        = "mageos-security-package"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["meta"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"cc40114ea2ffbc05af8310f562e2d3f869c7e215967226a656814ea748cda064\"" -> "W/\"9177515ccb2c9d59a952cd1d7ad6b8bfd3792c15a19896327f42a15fa406bfbf\""
        id                          = "meta"
        name                        = "meta"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["namespace"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"a469babc2d523595f250b3f8a29006ddd5da0ad66f8f30e8cc19d69d3b316bb6\"" -> "W/\"de4240430539209eb443060481c627a90423522e6fc69ceed6b02b738bdd9f1f\""
        id                          = "namespace"
        name                        = "namespace"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["terraform"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"6d3d426e66c86f3e4e6833c2a7aee58143441257322b1a9d89ec4ae7ac5ed111\"" -> "W/\"f50c32dcd73d4e98d6f9102be89bbc917518ad0150156bd54617ad01f72c64de\""
        id                          = "terraform"
        name                        = "terraform"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.codeowners["mage-os-website"] has changed
  ~ resource "github_repository_file" "codeowners" {
      ~ commit_author       = "mage-os-ci" -> "Mage-OS CI Bot"
      ~ commit_email        = "info@mage-os.org" -> "info+ci@mage-os.org"
        id                  = "mage-os-website/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team.teams["async-events"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"46e88868d0f12e42f4d70f9be4010b0e7df3e68cb137358484b750538fa7b65b\"" -> "W/\"efdeddfa2528b12dcd3464fd6c44473408e84e55941d9d5fd83cfec51a1e268d\""
        id                        = "7998296"
      ~ members_count             = 0 -> 1
        name                      = "async-events"
        # (5 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"e4f22cbf09e8f86f4594e40dcad263332e58238657b486d1426de639f2bb1daa\"" -> "W/\"521717bf8ccc9274ee30aeab66b4a7bb4e591643e602bff51ca717e6d6dcaddf\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"8bc477a9a78c365ec9296aba258cc64e14ad3d0feebc6517a8ef555fa17d7f45\"" -> "W/\"8e72483357dc26bff2c9831af98d32d1b980d4778c12bb54a7dd9345591a07d9\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"c6bf621bafff7d90e71a18e90a92173701e2c6f6900197c7a8fdccba57e8024a\"" -> "W/\"56c71b7f0b5ae28ec7e0ac64d957c6cfa1d2ea9e2d475fc5f39f5581788ce269\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"0c8224af054bc3cc6e5b60972c86e6877be42d728363410076acd625d7e9f5da\"" -> "W/\"d4da1a780bb93fb13b6c7121430af9d47fc80f7abea6ce30af22960c86581c45\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"8060a4ca8f1d4f369a65744dd9cbad426380664175b37a3c48f506cd702bd12b\"" -> "W/\"5e515bd4597f42f0d7c3fa28df01a43a933a207e131cb28ba945b3c5972ef537\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["DavidLambauer_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"db4b157099eabbdb047800ea156f9e0f4a6e6266c5851f74871c03ea540c9c0e\"" -> "W/\"073f2746d713c499e4de2a684c3f3b423ef49dd9f11350321da8c8888d1b746f\""
        id       = "6847100:DavidLambauer"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"dcf4cf88f6e6e1015e66f68f507cbaace029b3d081f923b9d584f2875dbe9838\"" -> "W/\"4f33a66d764a5fe8d79a9665646fb550ff9e8e377e9aceba61d80e7c38597175\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e6957c32bf0396ef4d774fd28de7c565c1c5525a9344eb1c76316f9f5e0db7a8\"" -> "W/\"e66e5f59b6e68890cbf4c07f38bd9474b9073f16ce1cae984e0542a6c623ee09\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"3edc433c05a9f6f222edfc6fbfd7952d9e7aaa71dd6388d9f34158bfbccfd8e3\"" -> "W/\"17042a38824bc212cf32ed85a82ac38f5b61289ab258cf74b3b654a5b5ab5f63\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"05db0a5009a1c7ea8d1e08bd13224d3fff238acceae33d69b12f36275276454e\"" -> "W/\"8026eaaa94265973ff2b4a1308354aabb739ce7d7b72da523b4a828fd27d31e0\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c707a6a08753e5ba9b27fc81d254aac33ea432fe50842e32a581db838b17f9fa\"" -> "W/\"25eb61b7dc7a4eb4a49910ff2cfa9fc9cdfb2fa737da94ba745e8edd487cfec3\""
        id       = "6847101:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e2111b2737df1243bb5f51a8104a46cd45156d291e06ef201a4d6642696348c6\"" -> "W/\"7fb6fc0bcc6492f08de956e56fbe84ffc9d9a9008bc9c8dfd3635c687e094f14\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["gowrizrh_async-events"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"5d0dbd16ae72b6d19ffcd6eec2439f2a4b0fed6dbc1fcd57545c8c945a9879c9\"" -> "W/\"060ee312b287ec4ff91a728aae28feb7c36028af537aa2840452a4591c33a4d0\""
        id       = "7998296:gowrizrh"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"682f28ea8d4985253495d692ac62f08cc5bbc698ef61b26d39a735b406102b2a\"" -> "W/\"6539c6c97e479b97cb50931e31b21b66096099f787b7e2792ae6d121a06e89a2\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"5b9ccbf874e0d201a766f3e79e89b44148da6718c8e01cff41192ff7bd8db84c\"" -> "W/\"cb0a5bf0f3fcc3f7587de5ca3e62a7f860b663780f09c7a0ea8cd355bbf4e302\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"26be1818849af175fcba016c7534496d97a27ca018a6f7d605ba9766a3e3e9da\"" -> "W/\"cd7e94c5ce51ff0d20dd70f43e56ad1e3942c55e8331ab68eb208d408f18dbac\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"8645ab590fc34197006a34b6b2efc1094d45c3e81bcb65bf028455409ab5c621\"" -> "W/\"b5b164aea091743cdafa42ca03216b4eef7a9e0472d7c7aec3b331f390917338\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c10ae4946116f25f4da3c88bc1dff6b969863f269c3972781e1aaf385e569e7d\"" -> "W/\"bedc113c6f585023f206828e5f95f06354be75d4dfd82f00695bdd6c8d0bb3fb\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["dev-env-gitpod_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"52b1a625ccaa3c37fd82748eecf013b37f3d4ee444adaeed1ccb834d842943ad\"" -> "W/\"b0d787638490e9c90b0d89db65d2e1be578856f22821aa4882588d1a090baefc\""
        id         = "6847100:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"8b0818eb815412e24d69b604dab667b9a943d4152dadd44c0c1caec2dc4da55a\"" -> "W/\"0dfbe185ead92407ab3e0174eeed35fbf63ee968875973d8ef78ca855b85a430\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["github-actions_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a33537525d5b37ec531bc3d11a4413f14ba1b6034594690d6aff6762a30eb928\"" -> "W/\"4c1fff2df0b4cd14f8d9efaf213c4e24c82e2cb22e292b34693a6b281bfdc14d\""
        id         = "6847101:github-actions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1a9046faa1416b54acb1a3c8ada517afb7e76f683195399dbaf30b1ca1d6b5e7\"" -> "W/\"aa9baf11a288b7334d355bdffbcd6c71a42907ffff71822841e668fa9731a7bb\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1088db21c9a3fd8f265c00dca806f6edd256310051ae449304e9d4a3e059f1c9\"" -> "W/\"d8feb9c97293a2cd53e82040ec04e56b58686e5088a523eedc76cabd037b55a9\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"415a3899e427d72abbf0609ef223a783b798ecf133f8ecf0cbb6b7f5e8b0f9bc\"" -> "W/\"5ebaab32232baa614b13f015117d15e6cebbf6d771b0f2cdf6afdf1b3e9c4334\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-async-events_async-events"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6765acd9f42de57cb13a9dd86666dea4658e00e023269817c0c0bdd7b315dd40\"" -> "W/\"4c011223ad0df393d9ec2f0722a518e515e0c306b1a700f8221d282ecddf85aa\""
        id         = "7998296:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-async-events_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6765acd9f42de57cb13a9dd86666dea4658e00e023269817c0c0bdd7b315dd40\"" -> "W/\"4c011223ad0df393d9ec2f0722a518e515e0c306b1a700f8221d282ecddf85aa\""
        id         = "6847101:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"561eaf3ec2a74214b1ed22fa1bc24243b568e07af6ad8508ea14d67e4aabfc80\"" -> "W/\"9514d8c1fb4ac187da69101953eda0ec8ed1c98984df52a77ed22a7fa9a5f85b\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"23e181d801a4a8cd5761ba22a2a2c1148a6c80bdb43d1ae2a78631c9c96f7961\"" -> "W/\"36d2406c009ddffe92d30733eec24fdf6d6aa1da1c33fb39acb59f8c96b9c1bd\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"d3b29bf68e0aaf7e493665acc96bc4aa90e9a8cc9c2400cc740f38e453d138b1\"" -> "W/\"0f07df33ab4b442c0686c96dd8e05e517543bb9dca219a8c5b1c42ff041cb256\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1312abcb404a7472fadd146e1bcbc3cafc0f4da9925b5497720df27e4f7cefbd\"" -> "W/\"524d3a286a32192dc073ea2368c21292a7248f082b9080b721591b5105b93168\""
        id         = "6847101:mageos-composer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"71b355d6e17ab9ec538975010fdd36dd1061538dd26c409acacb0c08910ffb40\"" -> "W/\"267713c4680fb86e0664baf1eb6d0f6eae8df5d451fc5afba997dbb22c0a43c2\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a2a71491553664d97442c061f81e6da6f9b16e3fb6044b06effbb800d49f007c\"" -> "W/\"6049d8d6853905566be3f2097600d96a443c10c06db99c340f542000bcb7f7d5\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-coding-standard_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"3f04d5f33e2bf58accfd0fd7b4e3c33de361d529083f24bb6caee6877d93b1b4\"" -> "W/\"7fbac99d3b399c4abc68472f3c662d26fb1ed5610efb57b740bb8edb5acd9fa2\""
        id         = "6847101:mageos-magento-coding-standard"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"71460b417e5fb86d111e7fdea81de5acc96bcafc148aaebe27b345debd92d0c7\"" -> "W/\"4a7f283298de63bfe7780d6bcd43bae1eb741890aeb28596e94399d02f7e7db6\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"049157a5c81bc898167b013f5a0ab2bcf156b1384c9ffe7d6a931606f6a05b57\"" -> "W/\"0dc083038add75a58ea9b5718f89e387d04990516fe6e41bcea61ebfd5be1a4a\""
        id         = "6847101:mageos-magento2-functional-testing-framework"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"bd682a1cf7e750541af3389b1696c48137877ef78618ff7efe2fd82586334983\"" -> "W/\"e4546b1d0e0a7c59ab0ce49a330ea17d8364d51cff8ced0a1a6c6afe23e836d8\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"530a2231cfa11802dde0bfb145eebbe987db11695400fbb7a3375ce655fd469b\"" -> "W/\"18bd43a691022aba0d02921fff6cdb0872f5977b73b3357cd61532237fbf257f\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e222baacb7a9d76be2c13c0d25e57a49fdd83666d97fd06dd0f661480700fac8\"" -> "W/\"bcc64533886baa3141f0a7a18894420a40169a8bb4f32bd947acc8be76ce1e3f\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"23376f93c596e3c45611e177c55a88a115ed89755aa443ebc7b824775022d56f\"" -> "W/\"920ebc10df489fe42b5630ceadb8d51a8ebb4a2edbed7ea5041c287d69cbf912\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"071c90424c0917c49d9cc5b3c6d9d3fb4b4ed4cc6ca5eb8366aaa6e7e48fcfd8\""
        id         = "6847102:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"071c90424c0917c49d9cc5b3c6d9d3fb4b4ed4cc6ca5eb8366aaa6e7e48fcfd8\""
        id         = "6847101:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"071c90424c0917c49d9cc5b3c6d9d3fb4b4ed4cc6ca5eb8366aaa6e7e48fcfd8\""
        id         = "6847100:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_tech-lead"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"474ab7f2d1b6e81b450e286825cfaca266c02bfba0da22dae5ae849339861613\""
        id         = "6847098:meta"
      ~ permission = "push" -> "maintain"
        # (2 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"13b16dff64192d7ef4c66419da1033634b8ffead490c44afe21e5ecd74e12a3b\"" -> "W/\"7d142f80682e116daad464a2d2b38ef9ea3c7e4891e862314aca02e17e1e4bf2\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["terraform_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1f6022c0a1f35cd254114c91170da4792b1ede2b00645efc2a527c965766bb69\"" -> "W/\"885d3285905efdb9e029c764e2abd7a9c85fb709e09b5c2a3dcaa03a8af962a9\""
        id         = "6847100:terraform"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["dev-env-gitpod"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ed02f6fdbd1fc9eccf3cf32c22ee6ba169be89e510c7d7aa5eb3000d31344166\"" -> "W/\"0725dd689a36c24d14713235e71370756f717f4e6de94b81ddbb3f35cdd60059\""
        id         = "6847098:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"e7a3266568512bde045fa50e2652f4d9f39c71a7ccdf05e507eae99969c9f1e6\"" -> "W/\"afe589cea9e871ac7a87714b7c65ec6cfffd54665cee8e3dd301dabb0e19786f\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["github-actions"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"c966ca48f751fd057cde095d8061e4c18d8478dc78e5cb7fd483aad4be609c35\"" -> "W/\"8d1362f223796b55362b0fe06a1bfa94ddc6419e1bbb16eb5385bb6f6116acfa\""
        id         = "6847098:github-actions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5bc37ddb2e82358d6762c188a2bbadf87b11314417a241fed640184a38037da2\"" -> "W/\"8d67421dca4048f3d7cfcb3fe1060bacbb0fde1b038d263dddf8fde9fb08b457\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"b9e5a3223f2cb47c376541456d1e71f35c6340bc5d1dd40a7d705b875b94b6a6\"" -> "W/\"2b1187c0a3039412cdcf28065bead8cc6e23a1fd0f39e4cfc80775cae921aa47\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"e340ff3eb7cb2f413431db80fc53f5f38253b5abd3dbfe2814379f2b1f552347\"" -> "W/\"a8b651f0293238554b2911108561e3b9644d87d3181cabf4c66a17ef398f21f7\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-async-events"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"64d2c36d25f9e16d52f409b4639f84be2cedac5d48a5cf638aa76b14c7cc90d9\"" -> "W/\"edcff80220ae2e7bd397dd8dfb319059633aace2a8e3f8579c023151da2bc5be\""
        id         = "6847098:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"fa7ee50da7c3a310eeca03a10717940c0c7b1cc82ce364a2d0fd975d89fd2593\"" -> "W/\"e53c3db26870a49220c4cea3e7d15ccee084b1334684c3f901e49637c51d5760\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"1d72edff2a9a54599fc8a0878ab040f4bc17b3af9dcbb1eb1faa74bf2e1c9779\"" -> "W/\"7090e0efaeb59b8bf367b822f42da6eb9092a5c1a74e7f8b000ddd3f9d48bad3\""
        id         = "6847098:mageos-composer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"870bfe780942ec56eb0a1ad902172f108fbbd66609ea52b4d338ecc8113945b2\"" -> "W/\"f7f6318717f10eabc69c5f1d1039154639a08e4408f743a2551184f71da896fa\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ceaca0debe7ed3b30fba3f35cc662cadd546d3d715c9358a4748047688c68007\"" -> "W/\"ab3ae9e9b498f6bdcdee9cb09430a45077a628e08bcb3963a18942cf0ad1d9ff\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"42f01557e8027b5c7212d586f8d01c5468848d84d6611e2ef5aa9f3bfd9bb507\"" -> "W/\"64fdc0b4c438691da73617468516b7a0fd0fed0450ced1126e466e3ec0e61202\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5b0e441717b87d6dcb83f6fbff7b4328f9d827131d24675508bdfa0e7e14b15e\"" -> "W/\"2f77c094d8c09fe0bdc1f6aa247748babff9d2a6ca7ff37a3f22cf1ee0274950\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-coding-standard"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"1174fbf8003133807b7fa0e9c64d7dfbcf4b4beda6fa13413a9d77ebfe17c74a\"" -> "W/\"c26063ff3a64f483c8b603a51cb6a3d3dbb7e53d47eb58dab2f8cb2dc03e116e\""
        id         = "6847098:mageos-magento-coding-standard"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a74e0b43728eff5ac61b3ce05a3a5488d346d50e3334b7514a2e0337fc685ff1\"" -> "W/\"c39e0626fd4a032b9f0cceee8a932ab5d789e26f108dd1abddd8ca08fa48cb50\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"3de4b973ca8c8af35c1c79b2c192e636ef0de4b1b926bbb5bf5747b4ba71fd42\"" -> "W/\"101cb3b1443870c61e9a7f8af1077815840e48567c0e5bc71b1d535aae3f3d7a\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"488b8fcc7512f4fb15ae41c2957b070f83682b56d2d59e18b92938cf134e3896\"" -> "W/\"7a4439c24b84443a5d9565508d14152202969a46c5357542e7ca84d7265d0803\""
        id         = "6847098:mageos-magento2-functional-testing-framework"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0cfda267f9b068e9ba33cbffab7701ecb19b9817fd722b3c7e3628ce9b6ad44a\"" -> "W/\"f0005f00afac27b1566f50a79f1bf612e2d9fbed0fa6ec54138ab9a8f69a2daa\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5c6103ac6370481e32f40929b244e9a6ad79b598c0f574e2c95dc1b7285e74f\"" -> "W/\"b4c5ce2b19503b39bf52a81d26ef4cda4122b5dbabafd5e4b8718df505e1093c\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5cb095412d722b309d7ed9efc707fd7dac0a1f2c318b7c3199b94dccb55aea4d\"" -> "W/\"a0321e0f2423d5cc5fa1de7f1d17ed07e20a3fae14c5cb47558528afe5c2df4a\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["meta"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a5fba73cd23e0c8d0b81859cdb2b9100e9952dcb3e1bc65351f5e88c44811e33\"" -> "W/\"474ab7f2d1b6e81b450e286825cfaca266c02bfba0da22dae5ae849339861613\""
        id         = "6847098:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"acc6dc9a391fd5c6abfa99cf67ee826855608c82e453d07f6b91bdaffed85314\"" -> "W/\"3df0a4df5759ce488469d05b73c74a7c83fce9236f0bd42eac8adb96dc9607b5\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"b93b5757623a7599730122965b1794d14fdecab19a0b387ce83457bb4a8f7456\"" -> "W/\"cc51278e4c42ac42059950e1521970744deac2f5aac265c2f689a3633837183b\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.repositories["devdocs-website"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repositories["devdocs-website"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Mage-OS devdocs website"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "devdocs-website"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "adobecommerce",
          + "documentation",
          + "ecommerce",
          + "mage-os",
          + "magento2",
        ]
      + visibility                  = (known after apply)

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # github_repository_file.codeowners["devdocs-website"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = (known after apply)
      + commit_author       = "mage-os-ci"
      + commit_email        = "info@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/infrastructure @Mage-OS/content"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "devdocs-website"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mage-os-website"] will be updated in-place
  ~ resource "github_repository_file" "codeowners" {
      ~ commit_author       = "Mage-OS CI Bot" -> "mage-os-ci"
      ~ commit_email        = "info+ci@mage-os.org" -> "info@mage-os.org"
        id                  = "mage-os-website/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team_repository.teams["devdocs-website_content"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "devdocs-website"
      + team_id    = "content"
    }

  # github_team_repository.teams["devdocs-website_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "devdocs-website"
      + team_id    = "infrastructure"
    }

  # github_team_repository.teams["meta_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["meta_tech-lead"] will be updated in-place
  ~ resource "github_team_repository" "teams" {
        id         = "6847098:meta"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["devdocs-website"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "devdocs-website"
      + team_id    = "6847098"
    }

Plan: 7 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/5342540190